PrivacyTitle = "《 隐私政策 》"
PrivacyText = [[
    本游戏接入了小米游戏服务SDK，提供登录和支付及实名制服务，所收集信息请阅读后文《小米游戏服务隐私政策》
    本隐私政策介绍本公司的隐私数据相关政策和惯例，这将涵盖我们如何收集、使用、处理、存储和/或披露那些通过本公司的移动App收集的关于您的个人信息。
请你仔细阅读我们的隐私政策。

一、本公司如何收集您的个人信息
个人信息是可用于唯一地识别或联系某人的数据。
当您使用本公司的移动App，注册用户过程中我们将会收集您的个人信息，如：电子邮件地址、电话号码。为了保护个人隐私，您不应提供除本公司特别要求之外的任何其它信息。
1.1您在注册本公司账户，使用本公司的产品或服务（如购买本公司的产品或服务、使用本公司的客户服务），访问本公司网页，或参加本公司的促销和有奖游戏时，向本公司提供的信息；
1.2您通过下载、更新、操作本公司的移动应用而向本公司提供的信息；
1.3您通过参加本公司的线上或线下比赛而向本公司提供的信息；
1.4您通过微博、微信等社交媒体与本公司互动而向本公司提供的信息；
1.5您通过本公司的服务向其他方提供的共享信息；
1.6其他您向本公司提供的信息。

二、本公司如何使用您的个人信息
1、通过您的个人信息，向您发送本公司移动App的服务信息。
2、通过您的个人信息实现密码找回功能。
3、除本公司发生重组、合并或出售，可将我们收集的一切个人信息转让给相关第三方外，本公司不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和本公司单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些信息。

三、个人信息安全
保证您的个人数据的安全对我们来说至关重要。
当您在本公司的移动App中注册输入个人数据时，我们会利用安全套接字层技术 (SSL) 对这些信息进行加密。
在数据传输和数据保管两个阶段里，我们会通过广为接受的行业标准（如防火墙、加密和数据隐私法律要求）来保护您向我们提交的信息。 然而，没有任何一种互联网传输或电子存储方法是100%安全的。
因此，尽管我们通过商业上可接受的方式来保护您的个人信息，但仍无法保证信息的绝对安全。

四、本公司会将个人信息保存多久
一般来说，本公司仅保留您的个人信息至履行收集目的所需的期限，同时将遵守适用法律规定的数据保留期限。

五、法律免责声明
在法律要求的情况下，以及本公司认为必须披露与您有关的信息来保护本公司的法定权益和/或遵守司法程序、法院指令或适用于本公司的移动App的法律程序时，我们有权透露您的个人信息。
如果本公司确定为了执行本公司的条款和条件或保护我们的经营，披露是合理必须的，则我们可披露与您有关的信息。

六、本隐私政策的更改
如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。
本公司保留随时修改本政策的权利，因此请经常查看。
如对本政策作出重大更改，本公司会通过网站通知的形式告知。

七、隐私问题
如果你对本公司的隐私政策或数据处理有任何问题或顾虑，请通过游戏客服邮箱：changleyouyl@126.com 与本公司联系



《小米游戏服务隐私政策》
游戏服务是北京瓦力网络科技有限公司（以下简称“瓦力”或“我们”）开发的，被集成于开发者产品或服务中，用于为用户提供登录游戏、支付订单、游戏内交流服务的产品。在此场景中，开发者作为数据控制者决定用户数据的处理目的、方式，游戏服务在为用户提供服务过程中作为数据处理者，接受开发者委托并根据开发者指示处理用户数据。为了说明我们会如何收集、使用和存储您的个人信息及您享有哪些权利，我们将通过本隐私政策向您阐述相关事宜。请您仔细阅读本隐私政策并确定了解我们对您个人信息的处理规则。如您不同意协议中的任何条款，请您向开发者提出主张停止使用游戏服务或者通过访问 https://privacy.mi.com/support 与我们联系。除本隐私政策以外的数据收集、使用和存储情况，请您参考开发者产品的隐私政策。

一、我们收集哪些信息以及如何使用信息
1. 实现游戏服务功能所必需的数据
为了给用户提供游戏服务功能，我们会收集您的设备相关信息，包括IMEI号/OAID（针对Android Q以上版本）、设备型号、制造商、手机序列号、网络MAC地址、设置国家或地区、屏幕分辨率和像素密度，同时也会收集您的软件相关信息，包括Android系统和SDK版本号、Android ID、游戏服务版本号、wifi 的 SSID/BSSID、MIUI版本号，以此针对不同设备和软件版本为您提供适配的游戏服务功能。
2. 实现实名认证和防沉迷机制
依据法律法规要求，部分游戏用户登录前需进行实名认证，为此我们会收集您的姓名和身份证号码，当您选择使用身份证照片进行实名认证时，我们会收集您的身份证照片和手机号码。 同时，为了落实防沉迷机制，我们会收集您使用的游戏包名和游戏使用时长，来对部分用户使用时间进行提示和限制。按照国家规定，游戏玩家需要进行实名认证且需要上报用户游戏数据，为此我们会收集您的游戏上下线时间、所玩的游戏标识、网络游戏防沉迷实名认证系统下发的用户身份标识。
3. 游戏登录
在您登录游戏时，依据您选择的登录方式，我们会收集您的小米账号、微信账号、微博账号、QQ账号及其昵称、头像，来为您提供登录服务。
4. 支付订单
我们会收集您正在使用的游戏的ID、游戏包名、游戏版本号、游戏商品名称、商品金额和安装来源，来标识您所使用的游戏。同时也会收集您的游戏账号和订单信息来确定您在游戏内的消费行为。
5. 支付安全
为了保证用户权益，我们会在检测到非官方提供的支付渠道时提示您。如果您点击举报，我们会收集您的游戏账号、OAID、IP信息及举报时间，以方便我们记录风险。
6. 福利
我们会为您提供与游戏相关的优惠券、礼包或抽奖，您可以在宝箱福利页面参与我们的活动，以更好的享受游戏。为了实现该功能，我们可能会收集您的游戏账号信息、领取的礼包信息、优惠券、参与抽奖活动的信息。

二、用户权利
您有权行使关于您的个人数据的权利，包括访问权、修改权等。根据相关适用法律若包含更多的权利，如删除权、反对或限制处理的权利、可携带权等，我们也将根据法律规定按照您的要求实现数据主体的权利。相关法律规定在对您的信息使用是基于您的同意的情况下，则有权撤回该同意。您可以通过向数据控制者提交您的要求，我们会在收到数据控制者的通知后对您的要求进行处理。如果您认为我们对您个人数据的处理违反了适用法律，您可以向监管机构投诉。

三、信息保护
我们非常重视个人信息安全，并采取一切合理可行的措施保护您的个人信息。我们会采用符合业界标准的安全防护措施以及行业内通行的安全技术来防止您的个人信息遭到未经授权的访问、修改,避免您的个人信息泄露、损坏或丢失。

四、信息保留
我们基于本隐私政策中所述的信息收集的目的所必需的期间，或者遵守适用的相关法律要求保留个人信息。个人信息在完成收集目的，或在我们确认您的删除或注销申请后，或我们终止运营相应产品或服务后，我们将停止保留，并做删除或匿名化处理。如果是出于公众利益、科学、历史研究或统计的目的，我们将基于适用的法律继续保留相关数据，即使进一步的数据处理与原有的收集目的无关。

您的信息将会保存至中华人民共和国境内。

四、与第三方服务提供商共享您的个人信息
本业务中部分服务内容由第三方服务提供商提供，为此我们需要向第三方服务提供商提供您的部分个人信息，点击查看我们向关联方、合作伙伴及第三方共享您的个人信息的情形。如我们与这些第三方分享您的个人信息，我们将采取加密等手段保障您的信息安全。对我们与之共享个人信息的公司、组织，我们会对其数据安全环境进行合理审查，并与其签署严格的数据处理协议，要求第三方对您的信息采取足够的保护措施，严格遵守相关法律法规与监管要求。

本隐私政策针对小米游戏服务，若本隐私政策与小米游戏中心隐私政策之间存在不一致的，以本隐私政策为准；若本隐私政策未约定的，以小米游戏中心隐私政策约定为准。

]]

