return {
	permission=
	{
		[1]=
		{
			line = 1,
			condi_key = "cpl_notcjj",
			jc_config = {12,13,14,15,16},
			share_config = {"bossqsb_bg_2","hlqkdhb_bg_2","mrbxl_bg_1"},
			is_show_invite_code = 0,
		},
		[2]=
		{
			line = 2,
			condi_key = "cpl_cjj",
			jc_config = {7,8,9,10,11},
			share_config = {"banner_001","banner_002"},
			is_show_invite_code = 0,
		},
	},
	jc_config=
	{
		[1]=
		{
			index = 1,
			title = "<size=42><color=#000000>1.如何跟好友成功绑定上下级关系？</color></size>",
			content = {"好友登陆游戏点击头像进入个人中心，填写您的邀请码即可成功绑定关系。（好友必须为未注册过游戏的新用户）","<color=#FF0000>好友需在注册7天内填写正确的邀请码，过期或填写错误视为无效。</color>"},
		},
		[2]=
		{
			index = 2,
			title = "<size=42><color=#000000>2.好友如何下载游戏？</color></size>",
			content = {"1）点击“邀请好友”按钮，会出现带有您推广码的下载海报，点击“微信分享”按钮的同时海报会保存到本地相册，将图片发给您的好友扫码下载游戏即可。",  "<color=#FF0000>海报不具备关系绑定功能，一定要让好友在个人中心填写推广码哦！</color>","2）关注公众号“鲸鱼初纪元”，转发给好友下载游戏即可"},
		},
		[3]=
		{
			index = 3,
			title = "<size=42><color=#000000>3.如何赚钱？</color></size>",
			content = {"邀请1位好友，您最高可赚30元，方式如下：","1）好友首次在限时红包兑换任意奖励，您得3元","2）好友成为VIP2，您得9元","3）好友成为VIP3，您得18元","<color=#FF0000>若好友在绑定成为您的下级之前已经完成任务，则绑定后无法为您贡献对应任务的奖励，好友列表中该任务状态会显示为“无效”。</color>"},
		},
		[4]=
		{
			index = 4,
			title = "<size=42><color=#000000>4.如何查看并提取收益？</color></size>",
			content = {"在【我的收益】中可查看并提取收益，收益可提取到您的支付宝账户，每日提取额度10～200元。点击“奖金明细”可查看收益流水。",},
		},
		[5]=
		{
			index = 5,
			title = "<size=42><color=#000000>5.如何查看好友列表和任务状态？</color></size>",
			content = {"在【我的收益】中可查看好友列表和任务状态",},
		},
		[6]=
		{
			index = 6,
			title = "<size=42><color=#000000>6.更多问题咨询：</color></size>",
			content = {"游戏问题：搜索公众号“鲸鱼初纪元”，点击“联系客服”咨询。",},
		},
		[7]=
		{
			index = 7,
			title = "<size=42><color=#000000>1.1.如何邀请好友？</color></size>",
			content = {"您从游戏中分享图片或链接到微信，好友下载并登陆后将自动绑定为您的下级。被邀请人必须是首次下载、安装并登陆游戏的新用户，否则无法成功绑定。","<color=#FF0000>您可在【赚钱】-【我的收益】页面查看已成功邀请的好友。</color>"},
		},
		[8]=
		{
			index = 8,
			title = "<size=42><color=#000000>2.2.推广奖金如何发放？</color></size>",
			content = {"推广奖励金以现金形式发放，在【我的收益】界面绑定支付宝可提取。每日可提取1次，10元起提，每次上限200元。",  },
		},
		[9]=
		{
			index = 9,
			title = "<size=42><color=#000000>3.3.如何快速赚钱？</color></size>",
			content = {"邀请1位好友，您最高可赚30元，方式如下：","1）好友首次在限时红包兑换任意奖励，您得3元","2）好友成为VIP2，您得9元","3）好友成为VIP3，您得18元",},
		},
		[10]=
		{
			index = 10,
			title = "<size=42><color=#000000>4.如何查看好友列表和任务状态？</color></size>",
			content = {"在【我的收益】中可查看好友列表和任务状态",},
		},
		[11]=
		{
			index = 11,
			title = "<size=42><color=#000000>5.更多问题咨询：</color></size>",
			content = {"搜索公众号“彩云新世界”，点击“联系客服”咨询。",},
		},
		[12]=
		{
			index = 12,
			title = "<size=42><color=#000000>1.1.如何邀请好友？</color></size>",
			content = {"您从游戏中分享图片或链接到微信，好友下载并登陆后将自动绑定为您的下级。被邀请人必须是首次下载、安装并登陆游戏的新用户，否则无法成功绑定。","<color=#FF0000>您可在【赚钱】-【我的收益】页面查看已成功邀请的好友。</color>"},
		},
		[13]=
		{
			index = 13,
			title = "<size=42><color=#000000>2.2.推广奖金如何发放？</color></size>",
			content = {"推广奖励金以现金形式发放，在【我的收益】界面绑定支付宝可提取。每日可提取1次，10元起提，每次上限200元。",  },
		},
		[14]=
		{
			index = 14,
			title = "<size=42><color=#000000>3.3.如何快速赚钱？</color></size>",
			content = {"邀请1位好友，您最高可赚30元，方式如下：","1）好友在限时红包兑换3元奖励金，您得3元","2）好友成为VIP2，您得9元","3）好友成为VIP3，您得18元","<color=#FF0000>若好友在绑定成为您的下级之前已经完成任务，则绑定后无法为您贡献对应任务的奖励，好友列表中该任务状态会显示为“无效”。</color>"},
		},
		[15]=
		{
			index = 15,
			title = "<size=42><color=#000000>4.如何查看好友列表和任务状态？</color></size>",
			content = {"在【我的收益】中可查看好友列表和任务状态",},
		},
		[16]=
		{
			index = 16,
			title = "<size=42><color=#000000>5.更多问题咨询：</color></size>",
			content = {"搜索公众号“鲸鱼初纪元”，点击“联系客服”咨询。",},
		},
	},
}